TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_НормативнаяСертификацияНоменклатуры/гкс_НормативнаяСертификацияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_НормативнаяСертификацияНоменклатуры</name>
  <registerRecords>InformationRegister.гкс_РезультатыНормативнойСертификацииНоменклатуры</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГОСТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НазначениеИспользованияКачества</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидПеревозки</name>
    <comment>ERP-2184</comment>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Анализы</name>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксЗначениеПоказателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательАнализа</name>
      <type>
        <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Базис</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтклонятьКачество</name>
      <comment>При отклонении от нормы - отклонять качество</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИскатьВнешниеПробы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_НормативнаяСертификацияНоменклатуры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("НормативнаяСертификацияНоменклатуры");
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов:
//     * Таблица<ИмяРегистра> - ТаблицаЗначений - таблица данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = гкс_ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если НЕ ДопПараметры.ПолучитьТекстыЗапроса Тогда
		
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		ЗаполнитьПараметрыИнициализации(Запрос, Документ);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		ТекстЗапросаТаблицагкс_РезультатыНормативнойСертификацииНоменклатуры(Запрос, ТекстыЗапроса, Регистры);
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат гкс_ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ТочкаМаршрута)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

// Для использования в процедуре ДобавитьКомандыСозданияНаОсновании других модулей менеджеров объектов.
// Добавляет в список команд создания на основании этот объект.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений, Неопределено - описание добавленной команды.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.гкс_НормативнаяСертификацияНоменклатуры) Тогда
		
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Идентификатор = Метаданные.Документы.гкс_НормативнаяСертификацияНоменклатуры.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = 
			гкс_ОбщегоНазначенияПЛК.ПредставлениеОбъекта(Метаданные.Документы.гкс_НормативнаяСертификацияНоменклатуры);
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.гкс_НормативнаяСертификацияНоменклатуры.ПолноеИмя();
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
	
	КонецЕсли;
	
	Возврат Неопределено; 
	
КонецФункции

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
 
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт
	
	ИсточникиДанных = Новый Соответствие;
	Возврат ИсточникиДанных;
	
КонецФункции

#Область Проведение

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицагкс_РезультатыНормативнойСертификацииНоменклатуры(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "гкс_РезультатыНормативнойСертификацииНоменклатуры";
	
	Если Не гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НормативнаяСертификацияНоменклатуры.Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	НормативнаяСертификацияНоменклатурыАнализы.ПоказательАнализа КАК ПоказательАнализа,
	|	НормативнаяСертификацияНоменклатурыАнализы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НормативнаяСертификацияНоменклатурыАнализы.ЗначениеПоказателя КАК ЗначениеПоказателя,
	|	НормативнаяСертификацияНоменклатурыАнализы.МаксЗначениеПоказателя КАК МаксимальноеЗначение,
	|	НормативнаяСертификацияНоменклатурыАнализы.Базис КАК Базис,
	|	НормативнаяСертификацияНоменклатурыАнализы.ОтклонятьКачество КАК ОтклонятьКачество,
	|	НормативнаяСертификацияНоменклатурыАнализы.ИскатьВнешниеПробы КАК ИскатьВнешниеПробы,
	|	НормативнаяСертификацияНоменклатуры.Организация КАК Организация,
	|	НормативнаяСертификацияНоменклатуры.Номенклатура КАК Номенклатура,
	|	НормативнаяСертификацияНоменклатуры.ТочкаМаршрута КАК ТочкаМаршрута,
	|	НормативнаяСертификацияНоменклатуры.ГОСТ КАК ГОСТ,
	|	ВЫБОР
	|		КОГДА НормативнаяСертификацияНоменклатуры.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДАТАВРЕМЯ(2099, 12, 31)
	|		ИНАЧЕ НормативнаяСертификацияНоменклатуры.ДатаОкончания
	|	КОНЕЦ КАК ПериодПо,
	|	НормативнаяСертификацияНоменклатуры.гкс_НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
	|	НормативнаяСертификацияНоменклатуры.гкс_ВидПеревозки КАК ВидПеревозки,
	|	НормативнаяСертификацияНоменклатуры.Дата КАК ПериодС
	|ИЗ
	|	Документ.гкс_НормативнаяСертификацияНоменклатуры.Анализы КАК НормативнаяСертификацияНоменклатурыАнализы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_НормативнаяСертификацияНоменклатуры КАК НормативнаяСертификацияНоменклатуры
	|		ПО НормативнаяСертификацияНоменклатурыАнализы.Ссылка = НормативнаяСертификацияНоменклатуры.Ссылка
	|ГДЕ
	|	НормативнаяСертификацияНоменклатурыАнализы.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
